const industry = [
  {
    "value": "广告/传媒/文化",
    data: ["广告/公关/会展", "影视/媒体", "文化/艺术/出版"],
  },
  {
    "value": "专业服务",
    data: ["咨询", "人才服务", "外包服务", "法律", "检测/认证", "专利/知识产权/商标", "财务/审计/税务"],
  },
  {
    "value": "金融",
    data: ["银行", "保险", "信托", "基金", "期货", "租凭", "证券", "投资/融资", "担保/典当/拍卖"],
  },
  {
    "value": "互联网/IT",
    data: ["计算机软件", "系统集成/IT服务", "互联网", "O2O", "互联网金融", "在线教育", "医疗服务", "网游/手游", "社交网络/SNS", "云计算/大数据", "在线旅游", "移动互联网", "电子商务", "智能硬件", "网络安全", "网络招聘"],
  },
  {
    "value": "电子/通信/硬件",
    data: ["计算机硬件/网络设备", "通信设备", "运营商增值服务", "电子/半导体/集体电路", "运营商/增值服务"],
  },
  {
    "value": "生活服务",
    data: ["餐饮", "中介服务", "旅游", "汽车租凭", "酒店", "丽人/美容/美发", "娱乐/休闲/体育", "婚庆/摄影"],
  },
  {
    "value": "交通/贸易/物流",
    data: ["贸易进出口", "交通/运输", "物流/仓储"],
  },
  {
    "value": "汽车",
    data: ["汽车生产", "汽车零配件", "汽车维修/保养/美容", "汽车销售", "汽车用品"],
  },
  {
    "value": "机械/制造",
    data: ["航空/航天", "摩托车/电动车/自行车", "原材料加工/摸具", "仪器/仪表/工业自动化", "印刷/包装/造纸", "机械制造/机电/重工"],
  },
  {
    "value": "能源/化工/环保",
    data: ["石油/石化/化工", "矿产/地质/采掘/冶炼", "电力/水利", "环保", "新能源（太阳能/风能）"],
  },
  {
    "value": "教育/培训",
    data: ["院校", "IT培训", "其他技能培训", "外语培训", "学前教育", "学术/科研"],
  },
  {
    "value": "消费品",
    data: ["零售（超市）/批发", "食品/饮料/烟酒/日化", "家电", "玩具/礼品", "办公用品及设备", "服装/服饰/纺织/皮革", "奢侈品/收藏品", "家具/家居", "珠宝/首饰/工艺品"],
  },
  {
    "value": "制药/医疗",
    data: ["制药（生物/化学）", "医疗卫生", "医疗器械"],
  },
  {
    "value": "农/林/牧/渔业/其他",
    data: ["养殖/种植/水产", "饲料/添加剂", "种子/化肥/农药", "其他"],
  },
  {
    "value": "政府/非营利机构",
    data: ["政府/公共事业", "非营利机构"],
  }
]

module.exports = industry